/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strlen.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: seok <seok@student.42seoul.kr>             +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/11/16 12:01:30 by seok              #+#    #+#             */
/*   Updated: 2022/12/30 10:56:56 by seok             ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

size_t	ft_strlen(const char *s)
{
	int	idx;

	idx = 0;
	if (s == 0) //TODO 문자열이 비었을 경우에 대해 예외처리해야함.
		return (0);
	while (s[idx])
		idx++;
	return ((size_t) idx);
}
